usr/share/doc/escenic/ece-guide.org
Guide for the /usr/bin/ece Script

* TAB completion
The ece script offers TAB completion, given that your version of BASH
supports this and that you have enabled it (some distributions hasn't
turned on BASH completion per default).

** Completing ece commands
You will find yourself using this regularly, both for speed, but also
to remember all the different options and their correct wording:
#+BEGIN_SRC sh
$ ece TAB TAB
applog      deploy      log         start       threaddump  
assemble    help        outlog      status      update      
clean       kill        restart     stop        versions 
#+END_SRC
The commands are all described in detail in "ece help"

** Completing types of servers the ece scripts can operate on
#+BEGIN_SRC sh
$ ece -t TAB TAB
analysis  engine    rmi-hub   search 
#+END_SRC

** Completing the publication resources available
The ece script can update the publication resources for a given
publication.

To help selecting the correct publication resource, you can make ece
list and complete the available resource names:
#+BEGIN_SRC sh
$ ece -p mypub -r TAB TAB
content-type   image-version  layout-group   
feature        layout         menu
#+END_SRC
* Getting an overview of all available options
#+BEGIN_SRC sh
$ ece help
Usage: /home/torstein/bin/ece [-t <type>] [-i <instance>] <command>

DESCRIPTION
 -t --type <type>
      The following types are available:
      engine  -  The Escenic Content Engine, this is the default
                 and is the assumed type if none is specified.
      search  -  A standalone search indexer and solr instance
      rmi-hub -  The RMI hub responsible for the internal 
                 communication between the ECE instances.
      analysis - The Escenic Analysis Engine also knows as 'Stats'

 -i --instance <instance>
      The type instance, such as editor1, web1 or search1

 -p --publication <publication>
      Needed only for updating publication resources

 -r --resource <resource>
      Used for updating publication resources.
      Must be one of: content-type, feature, layout, layout-group
                      image-version, menu

 -v --verbose
      Prints out debug statements, useful for debugging.

The following commands are available:
   applog     the type's app server log
   assemble   runs the Assembly Tool *)
   clean      removes temporary files created by /home/torstein/bin/ece *)
   deploy     deploys the assembled EAR *)
   help       prints this help screen
   kill       uses force to stop the type
   log        the type's Log4J log
   outlog     the [ece#engine] script log (system out log)
   restart    restarts the type
   start      starts the type
   status     checks if the type is running
   stop       stops the type
   threaddump write a thread dump to standard out (system out log)
   update     update publication resources
   versions   lists the ECE component versions

*) only applicable if type is 'engine'
#+END_SRC
