usr/share/doc/escenic/ece-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Guide for the /usr/bin/ece Script</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-25 12:08:05 CST"/>
<meta name="author" content="Torstein Krause Johansen"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>
<div id="content">

<svg
        id="vizrt-logo"
        version="1.1"
        width="138"
        height="84"
        > 
  <g
          id="g12"
          transform="matrix(1.25,0,0,-1.25,-451.34003,425.24315)"> 
    <g
            id="g14"
            transform="matrix(0.0246257,0,0,0.02458666,313.76213,231.21317)"> 
      <path
              d="m 3060.56,3437.2 -209.9,-593.4 -207.05,593.4 -215.82,0 326.08,-866.38 184.92,0 332.24,866.38 -210.47,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path16"/> 
      <path
              d="m 3473.3,2569.82 193.547,0 0,866.531 -193.547,0 0,-866.531 z"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path18"/> 
      <path
              d="m 3916.16,3436.36 -0.14,-177.24 364.23,0 -372.91,-554.74 0,-133.56 616.08,0 0,175.25 -374.66,0 366.68,550.78 0,139.51 -599.28,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path20"/> 
      <path
              d="m 4961.8,3436.66 c -56.15,0 -99.9,-9.02 -144.01,-53.04 -42.13,-42.13 -63.55,-93.63 -63.55,-153.7 l 0,-658.85 193.26,0 0,629.18 c 0,16.39 5.76,30.04 17.53,41.82 9.79,9.87 32.16,17.44 52.18,17.44 l 161.49,0 0,177.15 -216.9,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path22"/> 
      <path
              d="m 5367.91,3699.54 0,-915.91 c 0,-58.68 20.75,-109.43 62.13,-150.8 43.31,-43.47 85.57,-62.01 141.03,-62.01 l 212.69,0 0,174.7 -158.78,0 c -15.96,0 -28.96,5.5 -40.72,16.87 -11.19,11.53 -16.76,24.5 -16.76,40.65 l 0,456.42 216.26,0 0,176.39 -216.26,0 0,263.69 -199.59,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path24"/> 
      <path
              d="m 1921.16,3066.86 c -0.39,-514.15 173.24,-988.49 465.56,-1367.51 l 69.26,204.63 c -205.49,300.61 -333.44,658.06 -355.3,1043.68 l -179.52,119.2"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path26"/> 
      <path
              d="m 6404.28,3065.28 c 0.49,513.97 -173.17,988.55 -465.37,1367.26 l -69.46,-204.34 c 205.52,-300.7 333.61,-658.34 355.24,-1043.68 l 179.59,-119.24"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path28"/> 
 
    </g> 
  </g> 
</svg>
<h1>Guide for the /usr/bin/ece Script</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 TAB completion </a>
<ul>
<li><a href="#sec-1-1">1.1 Completing ece commands </a></li>
<li><a href="#sec-1-2">1.2 Completing types of servers the ece scripts can operate on </a></li>
<li><a href="#sec-1-3">1.3 Completing the publication resources available </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Getting an overview of all available options </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> TAB completion </h2>
<div class="outline-text-2" id="text-1">

<p>The ece script offers TAB completion, given that your version of BASH
supports this and that you have enabled it (some distributions hasn't
turned on BASH completion per default).
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Completing ece commands </h3>
<div class="outline-text-3" id="text-1-1">

<p>You will find yourself using this regularly, both for speed, but also
to remember all the different options and their correct wording:
</p>


<pre class="example">$ ece TAB TAB
applog      deploy      log         start       threaddump  
assemble    help        outlog      status      update      
clean       kill        restart     stop        versions 

</pre>



<p>
The commands are all described in detail in "ece help"
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Completing types of servers the ece scripts can operate on </h3>
<div class="outline-text-3" id="text-1-2">




<pre class="example">$ ece -t TAB TAB
analysis  engine    rmi-hub   search 

</pre>




</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Completing the publication resources available </h3>
<div class="outline-text-3" id="text-1-3">

<p>The ece script can update the publication resources for a given
publication.
</p>
<p>
To help selecting the correct publication resource, you can make ece
list and complete the available resource names:
</p>


<pre class="example">$ ece -p mypub -r TAB TAB
content-type   image-version  layout-group   
feature        layout         menu

</pre>



</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Getting an overview of all available options </h2>
<div class="outline-text-2" id="text-2">




<pre class="example">$ ece help
Usage: /home/torstein/bin/ece [-t &lt;type&gt;] [-i &lt;instance&gt;] &lt;command&gt;

DESCRIPTION
 -t --type &lt;type&gt;
      The following types are available:
      engine  -  The Escenic Content Engine, this is the default
                 and is the assumed type if none is specified.
      search  -  A standalone search indexer and solr instance
      rmi-hub -  The RMI hub responsible for the internal 
                 communication between the ECE instances.
      analysis - The Escenic Analysis Engine also knows as 'Stats'

 -i --instance &lt;instance&gt;
      The type instance, such as editor1, web1 or search1

 -p --publication &lt;publication&gt;
      Needed only for updating publication resources

 -r --resource &lt;resource&gt;
      Used for updating publication resources.
      Must be one of: content-type, feature, layout, layout-group
                      image-version, menu

 -v --verbose
      Prints out debug statements, useful for debugging.

The following commands are available:
   applog     the type's app server log
   assemble   runs the Assembly Tool *)
   clean      removes temporary files created by /home/torstein/bin/ece *)
   deploy     deploys the assembled EAR *)
   help       prints this help screen
   kill       uses force to stop the type
   log        the type's Log4J log
   outlog     the [ece#engine] script log (system out log)
   restart    restarts the type
   start      starts the type
   status     checks if the type is running
   stop       stops the type
   threaddump write a thread dump to standard out (system out log)
   update     update publication resources
   versions   lists the ECE component versions

*) only applicable if type is 'engine'

</pre>



</div>
</div>
<div id="postamble">
<p class="date">Date: 2011-08-25 12:08:05 CST</p>
<p class="author">Author: Torstein Krause Johansen</p>
<p class="creator">Org version 7.6 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
